Revit 2027 API
BuiltInFailures.CreationFailures.SwitchFromLegendBeforeCreateSimilar Property
 To Create Similar from a Legend View, first select the element, then activate the target view, then invoke Create Similar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SwitchFromLegendBeforeCreateSimilar { get; }
Public Shared ReadOnly Property SwitchFromLegendBeforeCreateSimilar As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SwitchFromLegendBeforeCreateSimilar {
	FailureDefinitionId^ get ();
}
static member SwitchFromLegendBeforeCreateSimilar : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace